PHIGGit/app/controllers/stories_controller.rb

    def create
        @story = Story.new(story_params)

        if @story.save
---
INSERT INTO "stories" ("text", "title", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "asdf"], ["title", "heel"], ["img_url", "asdf"], ["created_at", "2018-08-31 14:41:02.165016"], ["updated_at", "2018-08-31 14:41:02.165016"]]