app/controllers/comments_controller.rb

  def create

      @comment= @commentable.comments.new comment_params
      if @comment.save then
---
INSERT INTO "comments" ("text", "created_at", "updated_at", "commentable_id", "commentable_type") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "asdfasdf"], ["created_at", "2018-09-01 18:07:42.917766"], ["updated_at", "2018-09-01 18:07:42.917766"], ["commentable_id", 1], ["commentable_type", "Story"]]

  def find_commentable
    @commentable= Comment.find_by_id(params[:comment_id]) if params[:comment_id]
    @commentable = Story.find_by_id(params[:story_id]) if params[:story_id]
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]