app/controllers/sessions_controller.rb

  def new
    user = User.find_by_username(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT ?  [["LIMIT", 1]]