app/controllers/stories_controller.rb

    def create
        @story = Story.new(story_params)

        if @story.save
---
INSERT INTO "stories" ("text", "title", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"