app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @user = User.new
    @users = User.all

INSERT INTO "users" ("name", "email", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Gob"], ["email", "gob@ad.com"], ["username", "Gogo"], ["created_at", "2018-08-31 15:32:24.673305"], ["updated_at", "2018-08-31 15:32:24.673305"]]
---
  def create
    @user = User.new(user_params)

    if
      @user.save